#+TITLE: Guia Ejercicios - Memoria Virtual + Segmentación
#+STARTUP: inlineimages
*** Punto 1 - Algoritmo LRU
    |---------------------+-------+---------------------------+----+------------+------------------------|
    | Puntero (si aplica) | Marco | Página (Numerada desde 0) | Us | Modificado | Instante de referencia |
    |---------------------+-------+---------------------------+----+------------+------------------------|
    |                     |     1 |                        14 |  1 |          1 |                     28 |
    |                     |     3 |                        17 |  1 |          0 |                      3 |
    |                     |     5 |                        19 |  1 |          1 |                     15 |
    | -->                 |     8 |                        -- |  - |         -- |                     -- |
    |---------------------+-------+---------------------------+----+------------+------------------------|

    Las páginas {17,19,14} son las dadas en la tabla extra, las agregamos para que sea más cómodo
    *asumimos que si se accede a una dirección inválida termina la ejecución del proceso*
    
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Sec. Paginas           | 17(L) | 19(E) | 14(E) | 0(L) | 15(E) | 12(L) | 17(E) | 15(L) | 19(E) | 21(L) | TOTAL |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Frame 1                |       |       |       |   14 |    14 |    14 |  ~17~ |    17 |    17 |       |       |
    | Frame 3                |       |       |       |   17 |  ~15~ |    15 |    15 |    15 |    15 |       |       |
    | Frame 5                |       |       |       |   19 |    19 |  ~12~ |    12 |    12 |    12 |       |       |
    | Frame 8                |       |       |       |  ~0~ |     0 |     0 |     0 |     0 |  ~19~ |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Page Fault             |       |       |       |    1 |     1 |     1 |     1 |     0 |     1 | PF    |     4 |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Acceso a Disco         |       |       |       |    1 |     1 |     2 |     2 |     0 |     1 |       |     6 |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Lectura   |       |       |       |  p=0 |  p=15 |  p=12 |  p=17 |       |  p=19 |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Escritura |       |       |       |      |       |  p=19 |  p=14 |       |       |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    #+TBLFM: @6$12=vsum($5..$9)::@7$12=vsum($5..$9)

    #+BEGIN_QUOTE
    en la pagina 21 va a fallar, porque no es numero_pagina válida, sólo son válidas de la 0 a la 19

    en la posicion=2 de la sec. de paginas, reemplaza la pagina 17 por 15, 
    porque la pag.17 es la que hace mas tiempo está, es la menos reciente utilizada en el pasado (instante de ultima referencia que es 3)
    las otras son mas recientes porque su valor es 15,28
    
    lo mismo en la posicion=3, cuando reemplaza la 19 por la 12, la menos reciente utilizada era la 19 (instante=15)
    podrias verlo en la tabla como que estaba en el pasado (la 15 y 0 no podian porque eran muy recientes)
    #+END_QUOTE
*** Punto 1 - Algoritmo Clock Modificado
    |---------------------+-------+---------------------------+---------+----------------+------------------------|
    | Puntero (si aplica) | Marco | Página (Numerada desde 0) | BIT Uso | BIT Modificado | Instante de referencia |
    |---------------------+-------+---------------------------+---------+----------------+------------------------|
    |                     |     1 |                        14 |       1 |              1 |                     28 |
    |                     |     3 |                        17 |       1 |              0 |                      3 |
    |                     |     5 |                        19 |       1 |              1 |                     15 |
    | -->                 |     8 |                        -- |       - |             -- |                     -- |
    |---------------------+-------+---------------------------+---------+----------------+------------------------|

    Las páginas {17,19,14} son las dadas en la tabla extra, las agregamos para que sea más cómodo
    *asumimos que si se accede a una dirección inválida termina la ejecución del proceso*
    
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Sec. Paginas           | 17(L) | 19(E) | 14(E) | 0(L)       | 15(E)      | 12(L)      | 17(E)      | 15(L)      | 19(E)      | 21(L) | TOTAL |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Frame 1                |       |       |       | ->14^(1,1) | 14^(0,1)   | ->14^(0,1) | ~17^(1,1)~ | 17^(1,1)   | 17^(1,1)   |       |       |
    | Frame 3                |       |       |       | 17^(1,0)   | ~15^(1,1)~ | 15^(0,1)   | ->15^(0,1) | ->15^(1,1) | ->15^(1,1) |       |       |
    | Frame 5                |       |       |       | 19^(1,1)   | ->19^(0,1) | 19^(0,1)   | 19^(0,1)   | 19^(0,1)   | 19^(1,1)   |       |       |
    | Frame 8                |       |       |       | ~0^(1,0)~  | 0^(0,0)    | ~12^(1,0)~ | 12^(1,0)   | 12^(1,0)   | 12^(1,0)   |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Page Fault             |       |       |       | 1          | 1          | 1          | 1          | 0          | 0          |     1 |     4 |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Acceso a Disco         |       |       |       | 1          | 1          | 1          | 2          | 0          | 0          |       |     5 |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Operación de Lectura   |       |       |       | p=0        | p=15       | p=12       | p=17       |            |            |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Operación de Escritura |       |       |       |            |            |            | p=14       |            |            |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    #+TBLFM: @6$12=vsum($5..$9)::@7$12=vsum($5..$9)
    
    Entre la posicion=4,5 de la secuencia de páginas el algoritmo de clock modificado hará
    - 1ra vuelta: modificará los bit de uso en u=0, quedando en este orden 14^(0,1),   17^(0,0),   19^(0, 1)
    - 2da vuelta: va a buscar por prioridad en este orden (u=0,m=0), (u=0, m=1), (u=1, m=1)
    - 3ra vueta: algoritmo sustituye la pagina 17 por la 15 porque tiene (u=0, m=0), y mueve el puntero al siguiente frame

    |------------+------------+------------+------------|
    |            | 1ra vuelta | 2da vuelta | 3ra vuelta |
    |------------+------------+------------+------------|
    | ->14^(1,1) | 14^(0,1)   | 14^(0,1)   | 14^(0,1)   |
    | 17^(1,0)   | 17^(0,0)   | ->17^(0,0) | ~15^(1,1)~ |
    | 19^(1,1)   | 19^(0,0)   | 19^(0,1)   | ->19^(0,1) |
    | 0^(1,0)    | ->0^(0,0)  | 0^(0,0)    | 0^(0,0)    |
    |------------+------------+------------+------------|
